{
 "cells": [
  {
   "cell_type": "code",
   "execution_count": 1,
   "metadata": {
    "collapsed": true
   },
   "outputs": [],
   "source": [
    "# Purpose:  Pull a random sample of tweets to use as final validation set for candidate-sentiment classifiers.\n",
    "#           This will produce 10 per partition per candidate, for 400 per candidate, and 2000 total tweets. \n",
    "# Author:  Carol Sniegoski, adapted from Debbie Hofman\n",
    "# Date:  May 18, 2016\n",
    "# Course:  MAS DSE Capstone, Spring 2016"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 8,
   "metadata": {
    "collapsed": false
   },
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "['Trump', 'Clinton', 'Sanders', 'Cruz', 'Rubio']\n"
     ]
    }
   ],
   "source": [
    "candidates = ['Trump','Clinton','Sanders','Cruz','Rubio']\n",
    "print candidates"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 9,
   "metadata": {
    "collapsed": false
   },
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "done\n"
     ]
    }
   ],
   "source": [
    "# Define queries for obtaining tweets that mention each candidate.\n",
    "# The queries defined here get random samples. They do not exclude mentions of other candidates.\n",
    "\n",
    "# This approach is very time-consuming. It may be doing a giant sort on everything.\n",
    "# example:\n",
    "# MATCH (t:Tweet_2016_3_1)\n",
    "# WHERE EXISTS(t.mentions_Sanders) \n",
    "# WITH t, rand() as random\n",
    "# RETURN t.text ORDER BY random LIMIT 10\n",
    "\n",
    "# This approach is not entirely random, but it is quick, and sort of random.\n",
    "# MATCH (t:Tweet_2016_3_1)\n",
    "# WHERE EXISTS(t.mentions_Sanders) \n",
    "# WITH t.text as tweetText\n",
    "# WHERE rand()<.0001\n",
    "# RETURN tweetText LIMIT 10\n",
    "\n",
    "queries = {}\n",
    "\n",
    "queries['Sanders'] = \"\"\"MATCH (t:Tweet_{0})\n",
    "WHERE EXISTS(t.mentions_Sanders) \n",
    "WITH t.text as tweetText\n",
    "WHERE rand()<.001\n",
    "RETURN tweetText LIMIT 10\n",
    "\"\"\"\n",
    "\n",
    "queries['Clinton'] = \"\"\"MATCH (t:Tweet_{0})\n",
    "WHERE EXISTS(t.mentions_Clinton) \n",
    "WITH t.text as tweetText\n",
    "WHERE rand()<.001\n",
    "RETURN tweetText LIMIT 10\n",
    "\"\"\"\n",
    "\n",
    "queries['Trump'] = \"\"\"MATCH (t:Tweet_{0})\n",
    "WHERE EXISTS(t.mentions_Trump) \n",
    "WITH t.text as tweetText\n",
    "WHERE rand()<.0001\n",
    "RETURN tweetText LIMIT 10\n",
    "\"\"\"\n",
    "\n",
    "queries['Rubio'] = \"\"\"MATCH (t:Tweet_{0})\n",
    "WHERE EXISTS(t.mentions_Rubio) \n",
    "WITH t.text as tweetText\n",
    "WHERE rand()<.001\n",
    "RETURN tweetText LIMIT 10\n",
    "\"\"\"\n",
    "\n",
    "queries['Cruz'] = \"\"\"MATCH (t:Tweet_{0})\n",
    "WHERE EXISTS(t.mentions_Cruz) \n",
    "WITH t.text as tweetText\n",
    "WHERE rand()<.001\n",
    "RETURN tweetText LIMIT 10\n",
    "\"\"\"\n",
    "\n",
    "print 'done'"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 10,
   "metadata": {
    "collapsed": false
   },
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "done\n"
     ]
    }
   ],
   "source": [
    "partitions = ['2015_10_11', '2015_10_12', '2015_10_13', '2015_10_14', '2015_10_15',\\\n",
    "              '2016_1_26', '2016_1_27', '2016_1_28', '2016_1_29', '2016_1_30', '2016_2_3', \\\n",
    "              '2016_2_4', '2016_2_5', '2016_2_6', '2016_2_7', '2016_2_8', '2016_2_9', '2016_2_10',\\\n",
    "              '2016_2_11', '2016_2_12', '2016_2_13', '2016_2_14', '2016_2_15', \\\n",
    "              '2016_2_23', '2016_2_24', '2016_2_25', '2016_2_26', '2016_3_1', '2016_3_2',\\\n",
    "             '2016_3_3', '2016_3_4', '2016_3_5', '2016_3_6', '2016_3_7', '2016_3_8', '2016_3_9',\\\n",
    "             '2016_3_10', '2016_3_11']\n",
    "\n",
    "# partitions = ['2016_2_24', '2016_2_25', '2016_2_26', '2016_3_1', '2016_3_2',\\\n",
    "#              '2016_3_3', '2016_3_4', '2016_3_5', '2016_3_6', '2016_3_7', '2016_3_8', '2016_3_9',\\\n",
    "#              '2016_3_10', '2016_3_11']\n",
    "\n",
    "print 'done'"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 11,
   "metadata": {
    "collapsed": false
   },
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "opening driver...\n",
      "after opening driver...\n"
     ]
    }
   ],
   "source": [
    "from neo4j.v1 import GraphDatabase, basic_auth\n",
    "import time\n",
    "import csv\n",
    "\n",
    "#driver = GraphDatabase.driver(\"bolt://sauce5.sdsc.edu\", auth=basic_auth(\"neo4j\", \"lajolla\"))\n",
    "print 'opening driver...'\n",
    "driver = GraphDatabase.driver(\"bolt://sauce5.sdsc.edu\", auth=basic_auth(\"neo4j\", \"lajolla\"))\n",
    "#driver = GraphDatabase.driver(\"bolt://127.0.0.1\")\n",
    "print 'after opening driver...'"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 12,
   "metadata": {
    "collapsed": false
   },
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "candidatesentiment_fromDebbie_05-14-16.csv  \u001b[34moutput\u001b[m\u001b[m/\r\n",
      "candidatesentiment_fromDebbie_05-17-16.csv  sentimentsamples_random_05-18-16.csv\r\n"
     ]
    }
   ],
   "source": [
    "# Locate data output directory\n",
    "%ls ../data/candidatesentiment/"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 18,
   "metadata": {
    "collapsed": false
   },
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "../data/candidatesentiment/candidatesentiment_validationSet_random_05-19-16.csv\n"
     ]
    }
   ],
   "source": [
    "# Create output filename.\n",
    "prefix = \"../data/candidatesentiment/\"\n",
    "filename = \"candidatesentiment_validationSet_random_05-19-16.csv\"\n",
    "outfile = prefix + filename\n",
    "print outfile"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 19,
   "metadata": {
    "collapsed": false
   },
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "['Trump', 'Clinton', 'Sanders', 'Rubio', 'Cruz']\n"
     ]
    }
   ],
   "source": [
    "candidates = ['Trump', 'Clinton', 'Sanders', 'Rubio', 'Cruz']\n",
    "print candidates"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 20,
   "metadata": {
    "collapsed": false
   },
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "PARTITION: 2015_10_11\n",
      "\n",
      "CANDIDATE: Trump\n",
      "MATCH (t:Tweet_2015_10_11)\n",
      "WHERE EXISTS(t.mentions_Trump) \n",
      "WITH t.text as tweetText\n",
      "WHERE rand()<.0001\n",
      "RETURN tweetText LIMIT 10\n",
      "\n",
      "\n",
      "CANDIDATE: Clinton\n",
      "MATCH (t:Tweet_2015_10_11)\n",
      "WHERE EXISTS(t.mentions_Clinton) \n",
      "WITH t.text as tweetText\n",
      "WHERE rand()<.001\n",
      "RETURN tweetText LIMIT 10\n",
      "\n",
      "\n",
      "CANDIDATE: Sanders\n",
      "MATCH (t:Tweet_2015_10_11)\n",
      "WHERE EXISTS(t.mentions_Sanders) \n",
      "WITH t.text as tweetText\n",
      "WHERE rand()<.001\n",
      "RETURN tweetText LIMIT 10\n",
      "\n",
      "\n",
      "CANDIDATE: Rubio\n",
      "MATCH (t:Tweet_2015_10_11)\n",
      "WHERE EXISTS(t.mentions_Rubio) \n",
      "WITH t.text as tweetText\n",
      "WHERE rand()<.001\n",
      "RETURN tweetText LIMIT 10\n",
      "\n",
      "\n",
      "CANDIDATE: Cruz\n",
      "MATCH (t:Tweet_2015_10_11)\n",
      "WHERE EXISTS(t.mentions_Cruz) \n",
      "WITH t.text as tweetText\n",
      "WHERE rand()<.001\n",
      "RETURN tweetText LIMIT 10\n",
      "\n",
      "\n",
      "Time for partition 2015_10_11: 2.93518304825\n",
      "PARTITION: 2015_10_12\n",
      "\n",
      "CANDIDATE: Trump\n",
      "MATCH (t:Tweet_2015_10_12)\n",
      "WHERE EXISTS(t.mentions_Trump) \n",
      "WITH t.text as tweetText\n",
      "WHERE rand()<.0001\n",
      "RETURN tweetText LIMIT 10\n",
      "\n",
      "\n",
      "CANDIDATE: Clinton\n",
      "MATCH (t:Tweet_2015_10_12)\n",
      "WHERE EXISTS(t.mentions_Clinton) \n",
      "WITH t.text as tweetText\n",
      "WHERE rand()<.001\n",
      "RETURN tweetText LIMIT 10\n",
      "\n",
      "\n",
      "CANDIDATE: Sanders\n",
      "MATCH (t:Tweet_2015_10_12)\n",
      "WHERE EXISTS(t.mentions_Sanders) \n",
      "WITH t.text as tweetText\n",
      "WHERE rand()<.001\n",
      "RETURN tweetText LIMIT 10\n",
      "\n",
      "\n",
      "CANDIDATE: Rubio\n",
      "MATCH (t:Tweet_2015_10_12)\n",
      "WHERE EXISTS(t.mentions_Rubio) \n",
      "WITH t.text as tweetText\n",
      "WHERE rand()<.001\n",
      "RETURN tweetText LIMIT 10\n",
      "\n",
      "\n",
      "CANDIDATE: Cruz\n",
      "MATCH (t:Tweet_2015_10_12)\n",
      "WHERE EXISTS(t.mentions_Cruz) \n",
      "WITH t.text as tweetText\n",
      "WHERE rand()<.001\n",
      "RETURN tweetText LIMIT 10\n",
      "\n",
      "\n",
      "Time for partition 2015_10_12: 23.5902738571\n",
      "PARTITION: 2015_10_13\n",
      "\n",
      "CANDIDATE: Trump\n",
      "MATCH (t:Tweet_2015_10_13)\n",
      "WHERE EXISTS(t.mentions_Trump) \n",
      "WITH t.text as tweetText\n",
      "WHERE rand()<.0001\n",
      "RETURN tweetText LIMIT 10\n",
      "\n",
      "\n",
      "CANDIDATE: Clinton\n",
      "MATCH (t:Tweet_2015_10_13)\n",
      "WHERE EXISTS(t.mentions_Clinton) \n",
      "WITH t.text as tweetText\n",
      "WHERE rand()<.001\n",
      "RETURN tweetText LIMIT 10\n",
      "\n",
      "\n",
      "CANDIDATE: Sanders\n",
      "MATCH (t:Tweet_2015_10_13)\n",
      "WHERE EXISTS(t.mentions_Sanders) \n",
      "WITH t.text as tweetText\n",
      "WHERE rand()<.001\n",
      "RETURN tweetText LIMIT 10\n",
      "\n",
      "\n",
      "CANDIDATE: Rubio\n",
      "MATCH (t:Tweet_2015_10_13)\n",
      "WHERE EXISTS(t.mentions_Rubio) \n",
      "WITH t.text as tweetText\n",
      "WHERE rand()<.001\n",
      "RETURN tweetText LIMIT 10\n",
      "\n",
      "\n",
      "CANDIDATE: Cruz\n",
      "MATCH (t:Tweet_2015_10_13)\n",
      "WHERE EXISTS(t.mentions_Cruz) \n",
      "WITH t.text as tweetText\n",
      "WHERE rand()<.001\n",
      "RETURN tweetText LIMIT 10\n",
      "\n",
      "\n",
      "Time for partition 2015_10_13: 33.4510498047\n",
      "PARTITION: 2015_10_14\n",
      "\n",
      "CANDIDATE: Trump\n",
      "MATCH (t:Tweet_2015_10_14)\n",
      "WHERE EXISTS(t.mentions_Trump) \n",
      "WITH t.text as tweetText\n",
      "WHERE rand()<.0001\n",
      "RETURN tweetText LIMIT 10\n",
      "\n",
      "\n",
      "CANDIDATE: Clinton\n",
      "MATCH (t:Tweet_2015_10_14)\n",
      "WHERE EXISTS(t.mentions_Clinton) \n",
      "WITH t.text as tweetText\n",
      "WHERE rand()<.001\n",
      "RETURN tweetText LIMIT 10\n",
      "\n",
      "\n",
      "CANDIDATE: Sanders\n",
      "MATCH (t:Tweet_2015_10_14)\n",
      "WHERE EXISTS(t.mentions_Sanders) \n",
      "WITH t.text as tweetText\n",
      "WHERE rand()<.001\n",
      "RETURN tweetText LIMIT 10\n",
      "\n",
      "\n",
      "CANDIDATE: Rubio\n",
      "MATCH (t:Tweet_2015_10_14)\n",
      "WHERE EXISTS(t.mentions_Rubio) \n",
      "WITH t.text as tweetText\n",
      "WHERE rand()<.001\n",
      "RETURN tweetText LIMIT 10\n",
      "\n",
      "\n",
      "CANDIDATE: Cruz\n",
      "MATCH (t:Tweet_2015_10_14)\n",
      "WHERE EXISTS(t.mentions_Cruz) \n",
      "WITH t.text as tweetText\n",
      "WHERE rand()<.001\n",
      "RETURN tweetText LIMIT 10\n",
      "\n",
      "\n",
      "Time for partition 2015_10_14: 76.2868368626\n",
      "PARTITION: 2015_10_15\n",
      "\n",
      "CANDIDATE: Trump\n",
      "MATCH (t:Tweet_2015_10_15)\n",
      "WHERE EXISTS(t.mentions_Trump) \n",
      "WITH t.text as tweetText\n",
      "WHERE rand()<.0001\n",
      "RETURN tweetText LIMIT 10\n",
      "\n",
      "\n",
      "CANDIDATE: Clinton\n",
      "MATCH (t:Tweet_2015_10_15)\n",
      "WHERE EXISTS(t.mentions_Clinton) \n",
      "WITH t.text as tweetText\n",
      "WHERE rand()<.001\n",
      "RETURN tweetText LIMIT 10\n",
      "\n",
      "\n",
      "CANDIDATE: Sanders\n",
      "MATCH (t:Tweet_2015_10_15)\n",
      "WHERE EXISTS(t.mentions_Sanders) \n",
      "WITH t.text as tweetText\n",
      "WHERE rand()<.001\n",
      "RETURN tweetText LIMIT 10\n",
      "\n",
      "\n",
      "CANDIDATE: Rubio\n",
      "MATCH (t:Tweet_2015_10_15)\n",
      "WHERE EXISTS(t.mentions_Rubio) \n",
      "WITH t.text as tweetText\n",
      "WHERE rand()<.001\n",
      "RETURN tweetText LIMIT 10\n",
      "\n",
      "\n",
      "CANDIDATE: Cruz\n",
      "MATCH (t:Tweet_2015_10_15)\n",
      "WHERE EXISTS(t.mentions_Cruz) \n",
      "WITH t.text as tweetText\n",
      "WHERE rand()<.001\n",
      "RETURN tweetText LIMIT 10\n",
      "\n",
      "\n",
      "Time for partition 2015_10_15: 11.5498487949\n",
      "PARTITION: 2016_1_26\n",
      "\n",
      "CANDIDATE: Trump\n",
      "MATCH (t:Tweet_2016_1_26)\n",
      "WHERE EXISTS(t.mentions_Trump) \n",
      "WITH t.text as tweetText\n",
      "WHERE rand()<.0001\n",
      "RETURN tweetText LIMIT 10\n",
      "\n",
      "\n",
      "CANDIDATE: Clinton\n",
      "MATCH (t:Tweet_2016_1_26)\n",
      "WHERE EXISTS(t.mentions_Clinton) \n",
      "WITH t.text as tweetText\n",
      "WHERE rand()<.001\n",
      "RETURN tweetText LIMIT 10\n",
      "\n",
      "\n",
      "CANDIDATE: Sanders\n",
      "MATCH (t:Tweet_2016_1_26)\n",
      "WHERE EXISTS(t.mentions_Sanders) \n",
      "WITH t.text as tweetText\n",
      "WHERE rand()<.001\n",
      "RETURN tweetText LIMIT 10\n",
      "\n",
      "\n",
      "CANDIDATE: Rubio\n",
      "MATCH (t:Tweet_2016_1_26)\n",
      "WHERE EXISTS(t.mentions_Rubio) \n",
      "WITH t.text as tweetText\n",
      "WHERE rand()<.001\n",
      "RETURN tweetText LIMIT 10\n",
      "\n",
      "\n",
      "CANDIDATE: Cruz\n",
      "MATCH (t:Tweet_2016_1_26)\n",
      "WHERE EXISTS(t.mentions_Cruz) \n",
      "WITH t.text as tweetText\n",
      "WHERE rand()<.001\n",
      "RETURN tweetText LIMIT 10\n",
      "\n",
      "\n",
      "Time for partition 2016_1_26: 31.2281970978\n",
      "PARTITION: 2016_1_27\n",
      "\n",
      "CANDIDATE: Trump\n",
      "MATCH (t:Tweet_2016_1_27)\n",
      "WHERE EXISTS(t.mentions_Trump) \n",
      "WITH t.text as tweetText\n",
      "WHERE rand()<.0001\n",
      "RETURN tweetText LIMIT 10\n",
      "\n",
      "\n",
      "CANDIDATE: Clinton\n",
      "MATCH (t:Tweet_2016_1_27)\n",
      "WHERE EXISTS(t.mentions_Clinton) \n",
      "WITH t.text as tweetText\n",
      "WHERE rand()<.001\n",
      "RETURN tweetText LIMIT 10\n",
      "\n",
      "\n",
      "CANDIDATE: Sanders\n",
      "MATCH (t:Tweet_2016_1_27)\n",
      "WHERE EXISTS(t.mentions_Sanders) \n",
      "WITH t.text as tweetText\n",
      "WHERE rand()<.001\n",
      "RETURN tweetText LIMIT 10\n",
      "\n",
      "\n",
      "CANDIDATE: Rubio\n",
      "MATCH (t:Tweet_2016_1_27)\n",
      "WHERE EXISTS(t.mentions_Rubio) \n",
      "WITH t.text as tweetText\n",
      "WHERE rand()<.001\n",
      "RETURN tweetText LIMIT 10\n",
      "\n",
      "\n",
      "CANDIDATE: Cruz\n",
      "MATCH (t:Tweet_2016_1_27)\n",
      "WHERE EXISTS(t.mentions_Cruz) \n",
      "WITH t.text as tweetText\n",
      "WHERE rand()<.001\n",
      "RETURN tweetText LIMIT 10\n",
      "\n",
      "\n",
      "Time for partition 2016_1_27: 17.7354030609\n",
      "PARTITION: 2016_1_28\n",
      "\n",
      "CANDIDATE: Trump\n",
      "MATCH (t:Tweet_2016_1_28)\n",
      "WHERE EXISTS(t.mentions_Trump) \n",
      "WITH t.text as tweetText\n",
      "WHERE rand()<.0001\n",
      "RETURN tweetText LIMIT 10\n",
      "\n",
      "\n",
      "CANDIDATE: Clinton\n",
      "MATCH (t:Tweet_2016_1_28)\n",
      "WHERE EXISTS(t.mentions_Clinton) \n",
      "WITH t.text as tweetText\n",
      "WHERE rand()<.001\n",
      "RETURN tweetText LIMIT 10\n",
      "\n",
      "\n",
      "CANDIDATE: Sanders\n",
      "MATCH (t:Tweet_2016_1_28)\n",
      "WHERE EXISTS(t.mentions_Sanders) \n",
      "WITH t.text as tweetText\n",
      "WHERE rand()<.001\n",
      "RETURN tweetText LIMIT 10\n",
      "\n",
      "\n",
      "CANDIDATE: Rubio\n",
      "MATCH (t:Tweet_2016_1_28)\n",
      "WHERE EXISTS(t.mentions_Rubio) \n",
      "WITH t.text as tweetText\n",
      "WHERE rand()<.001\n",
      "RETURN tweetText LIMIT 10\n",
      "\n",
      "\n",
      "CANDIDATE: Cruz\n",
      "MATCH (t:Tweet_2016_1_28)\n",
      "WHERE EXISTS(t.mentions_Cruz) \n",
      "WITH t.text as tweetText\n",
      "WHERE rand()<.001\n",
      "RETURN tweetText LIMIT 10\n",
      "\n",
      "\n",
      "Time for partition 2016_1_28: 16.4857890606\n",
      "PARTITION: 2016_1_29\n",
      "\n",
      "CANDIDATE: Trump\n",
      "MATCH (t:Tweet_2016_1_29)\n",
      "WHERE EXISTS(t.mentions_Trump) \n",
      "WITH t.text as tweetText\n",
      "WHERE rand()<.0001\n",
      "RETURN tweetText LIMIT 10\n",
      "\n",
      "\n",
      "CANDIDATE: Clinton\n",
      "MATCH (t:Tweet_2016_1_29)\n",
      "WHERE EXISTS(t.mentions_Clinton) \n",
      "WITH t.text as tweetText\n",
      "WHERE rand()<.001\n",
      "RETURN tweetText LIMIT 10\n",
      "\n",
      "\n",
      "CANDIDATE: Sanders\n",
      "MATCH (t:Tweet_2016_1_29)\n",
      "WHERE EXISTS(t.mentions_Sanders) \n",
      "WITH t.text as tweetText\n",
      "WHERE rand()<.001\n",
      "RETURN tweetText LIMIT 10\n",
      "\n",
      "\n",
      "CANDIDATE: Rubio\n",
      "MATCH (t:Tweet_2016_1_29)\n",
      "WHERE EXISTS(t.mentions_Rubio) \n",
      "WITH t.text as tweetText\n",
      "WHERE rand()<.001\n",
      "RETURN tweetText LIMIT 10\n",
      "\n",
      "\n",
      "CANDIDATE: Cruz\n",
      "MATCH (t:Tweet_2016_1_29)\n",
      "WHERE EXISTS(t.mentions_Cruz) \n",
      "WITH t.text as tweetText\n",
      "WHERE rand()<.001\n",
      "RETURN tweetText LIMIT 10\n",
      "\n",
      "\n",
      "Time for partition 2016_1_29: 12.9763700962\n",
      "PARTITION: 2016_1_30\n",
      "\n",
      "CANDIDATE: Trump\n",
      "MATCH (t:Tweet_2016_1_30)\n",
      "WHERE EXISTS(t.mentions_Trump) \n",
      "WITH t.text as tweetText\n",
      "WHERE rand()<.0001\n",
      "RETURN tweetText LIMIT 10\n",
      "\n",
      "\n",
      "CANDIDATE: Clinton\n",
      "MATCH (t:Tweet_2016_1_30)\n",
      "WHERE EXISTS(t.mentions_Clinton) \n",
      "WITH t.text as tweetText\n",
      "WHERE rand()<.001\n",
      "RETURN tweetText LIMIT 10\n",
      "\n",
      "\n",
      "CANDIDATE: Sanders\n",
      "MATCH (t:Tweet_2016_1_30)\n",
      "WHERE EXISTS(t.mentions_Sanders) \n",
      "WITH t.text as tweetText\n",
      "WHERE rand()<.001\n",
      "RETURN tweetText LIMIT 10\n",
      "\n",
      "\n",
      "CANDIDATE: Rubio\n",
      "MATCH (t:Tweet_2016_1_30)\n",
      "WHERE EXISTS(t.mentions_Rubio) \n",
      "WITH t.text as tweetText\n",
      "WHERE rand()<.001\n",
      "RETURN tweetText LIMIT 10\n",
      "\n",
      "\n",
      "CANDIDATE: Cruz\n",
      "MATCH (t:Tweet_2016_1_30)\n",
      "WHERE EXISTS(t.mentions_Cruz) \n",
      "WITH t.text as tweetText\n",
      "WHERE rand()<.001\n",
      "RETURN tweetText LIMIT 10\n",
      "\n",
      "\n",
      "Time for partition 2016_1_30: 17.4344680309\n",
      "PARTITION: 2016_2_3\n",
      "\n",
      "CANDIDATE: Trump\n",
      "MATCH (t:Tweet_2016_2_3)\n",
      "WHERE EXISTS(t.mentions_Trump) \n",
      "WITH t.text as tweetText\n",
      "WHERE rand()<.0001\n",
      "RETURN tweetText LIMIT 10\n",
      "\n",
      "\n",
      "CANDIDATE: Clinton\n",
      "MATCH (t:Tweet_2016_2_3)\n",
      "WHERE EXISTS(t.mentions_Clinton) \n",
      "WITH t.text as tweetText\n",
      "WHERE rand()<.001\n",
      "RETURN tweetText LIMIT 10\n",
      "\n",
      "\n",
      "CANDIDATE: Sanders\n",
      "MATCH (t:Tweet_2016_2_3)\n",
      "WHERE EXISTS(t.mentions_Sanders) \n",
      "WITH t.text as tweetText\n",
      "WHERE rand()<.001\n",
      "RETURN tweetText LIMIT 10\n",
      "\n",
      "\n",
      "CANDIDATE: Rubio\n",
      "MATCH (t:Tweet_2016_2_3)\n",
      "WHERE EXISTS(t.mentions_Rubio) \n",
      "WITH t.text as tweetText\n",
      "WHERE rand()<.001\n",
      "RETURN tweetText LIMIT 10\n",
      "\n",
      "\n",
      "CANDIDATE: Cruz\n",
      "MATCH (t:Tweet_2016_2_3)\n",
      "WHERE EXISTS(t.mentions_Cruz) \n",
      "WITH t.text as tweetText\n",
      "WHERE rand()<.001\n",
      "RETURN tweetText LIMIT 10\n",
      "\n",
      "\n",
      "Time for partition 2016_2_3: 21.50334692\n",
      "PARTITION: 2016_2_4\n",
      "\n",
      "CANDIDATE: Trump\n",
      "MATCH (t:Tweet_2016_2_4)\n",
      "WHERE EXISTS(t.mentions_Trump) \n",
      "WITH t.text as tweetText\n",
      "WHERE rand()<.0001\n",
      "RETURN tweetText LIMIT 10\n",
      "\n",
      "\n",
      "CANDIDATE: Clinton\n",
      "MATCH (t:Tweet_2016_2_4)\n",
      "WHERE EXISTS(t.mentions_Clinton) \n",
      "WITH t.text as tweetText\n",
      "WHERE rand()<.001\n",
      "RETURN tweetText LIMIT 10\n",
      "\n",
      "\n",
      "CANDIDATE: Sanders\n",
      "MATCH (t:Tweet_2016_2_4)\n",
      "WHERE EXISTS(t.mentions_Sanders) \n",
      "WITH t.text as tweetText\n",
      "WHERE rand()<.001\n",
      "RETURN tweetText LIMIT 10\n",
      "\n",
      "\n",
      "CANDIDATE: Rubio\n",
      "MATCH (t:Tweet_2016_2_4)\n",
      "WHERE EXISTS(t.mentions_Rubio) \n",
      "WITH t.text as tweetText\n",
      "WHERE rand()<.001\n",
      "RETURN tweetText LIMIT 10\n",
      "\n",
      "\n",
      "CANDIDATE: Cruz\n",
      "MATCH (t:Tweet_2016_2_4)\n",
      "WHERE EXISTS(t.mentions_Cruz) \n",
      "WITH t.text as tweetText\n",
      "WHERE rand()<.001\n",
      "RETURN tweetText LIMIT 10\n",
      "\n",
      "\n",
      "Time for partition 2016_2_4: 16.4374380112\n",
      "PARTITION: 2016_2_5\n",
      "\n",
      "CANDIDATE: Trump\n",
      "MATCH (t:Tweet_2016_2_5)\n",
      "WHERE EXISTS(t.mentions_Trump) \n",
      "WITH t.text as tweetText\n",
      "WHERE rand()<.0001\n",
      "RETURN tweetText LIMIT 10\n",
      "\n",
      "\n",
      "CANDIDATE: Clinton\n",
      "MATCH (t:Tweet_2016_2_5)\n",
      "WHERE EXISTS(t.mentions_Clinton) \n",
      "WITH t.text as tweetText\n",
      "WHERE rand()<.001\n",
      "RETURN tweetText LIMIT 10\n",
      "\n",
      "\n",
      "CANDIDATE: Sanders\n",
      "MATCH (t:Tweet_2016_2_5)\n",
      "WHERE EXISTS(t.mentions_Sanders) \n",
      "WITH t.text as tweetText\n",
      "WHERE rand()<.001\n",
      "RETURN tweetText LIMIT 10\n",
      "\n",
      "\n",
      "CANDIDATE: Rubio\n",
      "MATCH (t:Tweet_2016_2_5)\n",
      "WHERE EXISTS(t.mentions_Rubio) \n",
      "WITH t.text as tweetText\n",
      "WHERE rand()<.001\n",
      "RETURN tweetText LIMIT 10\n",
      "\n",
      "\n",
      "CANDIDATE: Cruz\n",
      "MATCH (t:Tweet_2016_2_5)\n",
      "WHERE EXISTS(t.mentions_Cruz) \n",
      "WITH t.text as tweetText\n",
      "WHERE rand()<.001\n",
      "RETURN tweetText LIMIT 10\n",
      "\n",
      "\n",
      "Time for partition 2016_2_5: 54.8308138847\n",
      "PARTITION: 2016_2_6\n",
      "\n",
      "CANDIDATE: Trump\n",
      "MATCH (t:Tweet_2016_2_6)\n",
      "WHERE EXISTS(t.mentions_Trump) \n",
      "WITH t.text as tweetText\n",
      "WHERE rand()<.0001\n",
      "RETURN tweetText LIMIT 10\n",
      "\n",
      "\n",
      "CANDIDATE: Clinton\n",
      "MATCH (t:Tweet_2016_2_6)\n",
      "WHERE EXISTS(t.mentions_Clinton) \n",
      "WITH t.text as tweetText\n",
      "WHERE rand()<.001\n",
      "RETURN tweetText LIMIT 10\n",
      "\n",
      "\n",
      "CANDIDATE: Sanders\n",
      "MATCH (t:Tweet_2016_2_6)\n",
      "WHERE EXISTS(t.mentions_Sanders) \n",
      "WITH t.text as tweetText\n",
      "WHERE rand()<.001\n",
      "RETURN tweetText LIMIT 10\n",
      "\n",
      "\n",
      "CANDIDATE: Rubio\n",
      "MATCH (t:Tweet_2016_2_6)\n",
      "WHERE EXISTS(t.mentions_Rubio) \n",
      "WITH t.text as tweetText\n",
      "WHERE rand()<.001\n",
      "RETURN tweetText LIMIT 10\n",
      "\n",
      "\n",
      "CANDIDATE: Cruz\n",
      "MATCH (t:Tweet_2016_2_6)\n",
      "WHERE EXISTS(t.mentions_Cruz) \n",
      "WITH t.text as tweetText\n",
      "WHERE rand()<.001\n",
      "RETURN tweetText LIMIT 10\n",
      "\n",
      "\n",
      "Time for partition 2016_2_6: 39.0141119957\n",
      "PARTITION: 2016_2_7\n",
      "\n",
      "CANDIDATE: Trump\n",
      "MATCH (t:Tweet_2016_2_7)\n",
      "WHERE EXISTS(t.mentions_Trump) \n",
      "WITH t.text as tweetText\n",
      "WHERE rand()<.0001\n",
      "RETURN tweetText LIMIT 10\n",
      "\n",
      "\n",
      "CANDIDATE: Clinton\n",
      "MATCH (t:Tweet_2016_2_7)\n",
      "WHERE EXISTS(t.mentions_Clinton) \n",
      "WITH t.text as tweetText\n",
      "WHERE rand()<.001\n",
      "RETURN tweetText LIMIT 10\n",
      "\n",
      "\n",
      "CANDIDATE: Sanders\n",
      "MATCH (t:Tweet_2016_2_7)\n",
      "WHERE EXISTS(t.mentions_Sanders) \n",
      "WITH t.text as tweetText\n",
      "WHERE rand()<.001\n",
      "RETURN tweetText LIMIT 10\n",
      "\n",
      "\n",
      "CANDIDATE: Rubio\n",
      "MATCH (t:Tweet_2016_2_7)\n",
      "WHERE EXISTS(t.mentions_Rubio) \n",
      "WITH t.text as tweetText\n",
      "WHERE rand()<.001\n",
      "RETURN tweetText LIMIT 10\n",
      "\n",
      "\n",
      "CANDIDATE: Cruz\n",
      "MATCH (t:Tweet_2016_2_7)\n",
      "WHERE EXISTS(t.mentions_Cruz) \n",
      "WITH t.text as tweetText\n",
      "WHERE rand()<.001\n",
      "RETURN tweetText LIMIT 10\n",
      "\n",
      "\n",
      "Time for partition 2016_2_7: 27.6442270279\n",
      "PARTITION: 2016_2_8\n",
      "\n",
      "CANDIDATE: Trump\n",
      "MATCH (t:Tweet_2016_2_8)\n",
      "WHERE EXISTS(t.mentions_Trump) \n",
      "WITH t.text as tweetText\n",
      "WHERE rand()<.0001\n",
      "RETURN tweetText LIMIT 10\n",
      "\n",
      "\n",
      "CANDIDATE: Clinton\n",
      "MATCH (t:Tweet_2016_2_8)\n",
      "WHERE EXISTS(t.mentions_Clinton) \n",
      "WITH t.text as tweetText\n",
      "WHERE rand()<.001\n",
      "RETURN tweetText LIMIT 10\n",
      "\n",
      "\n",
      "CANDIDATE: Sanders\n",
      "MATCH (t:Tweet_2016_2_8)\n",
      "WHERE EXISTS(t.mentions_Sanders) \n",
      "WITH t.text as tweetText\n",
      "WHERE rand()<.001\n",
      "RETURN tweetText LIMIT 10\n",
      "\n",
      "\n",
      "CANDIDATE: Rubio\n",
      "MATCH (t:Tweet_2016_2_8)\n",
      "WHERE EXISTS(t.mentions_Rubio) \n",
      "WITH t.text as tweetText\n",
      "WHERE rand()<.001\n",
      "RETURN tweetText LIMIT 10\n",
      "\n",
      "\n",
      "CANDIDATE: Cruz\n",
      "MATCH (t:Tweet_2016_2_8)\n",
      "WHERE EXISTS(t.mentions_Cruz) \n",
      "WITH t.text as tweetText\n",
      "WHERE rand()<.001\n",
      "RETURN tweetText LIMIT 10\n",
      "\n",
      "\n",
      "Time for partition 2016_2_8: 37.1196951866\n",
      "PARTITION: 2016_2_9\n",
      "\n",
      "CANDIDATE: Trump\n",
      "MATCH (t:Tweet_2016_2_9)\n",
      "WHERE EXISTS(t.mentions_Trump) \n",
      "WITH t.text as tweetText\n",
      "WHERE rand()<.0001\n",
      "RETURN tweetText LIMIT 10\n",
      "\n",
      "\n",
      "CANDIDATE: Clinton\n",
      "MATCH (t:Tweet_2016_2_9)\n",
      "WHERE EXISTS(t.mentions_Clinton) \n",
      "WITH t.text as tweetText\n",
      "WHERE rand()<.001\n",
      "RETURN tweetText LIMIT 10\n",
      "\n",
      "\n",
      "CANDIDATE: Sanders\n",
      "MATCH (t:Tweet_2016_2_9)\n",
      "WHERE EXISTS(t.mentions_Sanders) \n",
      "WITH t.text as tweetText\n",
      "WHERE rand()<.001\n",
      "RETURN tweetText LIMIT 10\n",
      "\n",
      "\n",
      "CANDIDATE: Rubio\n",
      "MATCH (t:Tweet_2016_2_9)\n",
      "WHERE EXISTS(t.mentions_Rubio) \n",
      "WITH t.text as tweetText\n",
      "WHERE rand()<.001\n",
      "RETURN tweetText LIMIT 10\n",
      "\n",
      "\n",
      "CANDIDATE: Cruz\n",
      "MATCH (t:Tweet_2016_2_9)\n",
      "WHERE EXISTS(t.mentions_Cruz) \n",
      "WITH t.text as tweetText\n",
      "WHERE rand()<.001\n",
      "RETURN tweetText LIMIT 10\n",
      "\n",
      "\n",
      "Time for partition 2016_2_9: 53.2002620697\n",
      "PARTITION: 2016_2_10\n",
      "\n",
      "CANDIDATE: Trump\n",
      "MATCH (t:Tweet_2016_2_10)\n",
      "WHERE EXISTS(t.mentions_Trump) \n",
      "WITH t.text as tweetText\n",
      "WHERE rand()<.0001\n",
      "RETURN tweetText LIMIT 10\n",
      "\n",
      "\n",
      "CANDIDATE: Clinton\n",
      "MATCH (t:Tweet_2016_2_10)\n",
      "WHERE EXISTS(t.mentions_Clinton) \n",
      "WITH t.text as tweetText\n",
      "WHERE rand()<.001\n",
      "RETURN tweetText LIMIT 10\n",
      "\n",
      "\n",
      "CANDIDATE: Sanders\n",
      "MATCH (t:Tweet_2016_2_10)\n",
      "WHERE EXISTS(t.mentions_Sanders) \n",
      "WITH t.text as tweetText\n",
      "WHERE rand()<.001\n",
      "RETURN tweetText LIMIT 10\n",
      "\n",
      "\n",
      "CANDIDATE: Rubio\n",
      "MATCH (t:Tweet_2016_2_10)\n",
      "WHERE EXISTS(t.mentions_Rubio) \n",
      "WITH t.text as tweetText\n",
      "WHERE rand()<.001\n",
      "RETURN tweetText LIMIT 10\n",
      "\n",
      "\n",
      "CANDIDATE: Cruz\n",
      "MATCH (t:Tweet_2016_2_10)\n",
      "WHERE EXISTS(t.mentions_Cruz) \n",
      "WITH t.text as tweetText\n",
      "WHERE rand()<.001\n",
      "RETURN tweetText LIMIT 10\n",
      "\n",
      "\n",
      "Time for partition 2016_2_10: 104.23101306\n",
      "PARTITION: 2016_2_11\n",
      "\n",
      "CANDIDATE: Trump\n",
      "MATCH (t:Tweet_2016_2_11)\n",
      "WHERE EXISTS(t.mentions_Trump) \n",
      "WITH t.text as tweetText\n",
      "WHERE rand()<.0001\n",
      "RETURN tweetText LIMIT 10\n",
      "\n",
      "\n",
      "CANDIDATE: Clinton\n",
      "MATCH (t:Tweet_2016_2_11)\n",
      "WHERE EXISTS(t.mentions_Clinton) \n",
      "WITH t.text as tweetText\n",
      "WHERE rand()<.001\n",
      "RETURN tweetText LIMIT 10\n",
      "\n",
      "\n",
      "CANDIDATE: Sanders\n",
      "MATCH (t:Tweet_2016_2_11)\n",
      "WHERE EXISTS(t.mentions_Sanders) \n",
      "WITH t.text as tweetText\n",
      "WHERE rand()<.001\n",
      "RETURN tweetText LIMIT 10\n",
      "\n",
      "\n",
      "CANDIDATE: Rubio\n",
      "MATCH (t:Tweet_2016_2_11)\n",
      "WHERE EXISTS(t.mentions_Rubio) \n",
      "WITH t.text as tweetText\n",
      "WHERE rand()<.001\n",
      "RETURN tweetText LIMIT 10\n",
      "\n",
      "\n",
      "CANDIDATE: Cruz\n",
      "MATCH (t:Tweet_2016_2_11)\n",
      "WHERE EXISTS(t.mentions_Cruz) \n",
      "WITH t.text as tweetText\n",
      "WHERE rand()<.001\n",
      "RETURN tweetText LIMIT 10\n",
      "\n",
      "\n",
      "Time for partition 2016_2_11: 71.5781910419\n",
      "PARTITION: 2016_2_12\n",
      "\n",
      "CANDIDATE: Trump\n",
      "MATCH (t:Tweet_2016_2_12)\n",
      "WHERE EXISTS(t.mentions_Trump) \n",
      "WITH t.text as tweetText\n",
      "WHERE rand()<.0001\n",
      "RETURN tweetText LIMIT 10\n",
      "\n",
      "\n",
      "CANDIDATE: Clinton\n",
      "MATCH (t:Tweet_2016_2_12)\n",
      "WHERE EXISTS(t.mentions_Clinton) \n",
      "WITH t.text as tweetText\n",
      "WHERE rand()<.001\n",
      "RETURN tweetText LIMIT 10\n",
      "\n",
      "\n",
      "CANDIDATE: Sanders\n",
      "MATCH (t:Tweet_2016_2_12)\n",
      "WHERE EXISTS(t.mentions_Sanders) \n",
      "WITH t.text as tweetText\n",
      "WHERE rand()<.001\n",
      "RETURN tweetText LIMIT 10\n",
      "\n",
      "\n",
      "CANDIDATE: Rubio\n",
      "MATCH (t:Tweet_2016_2_12)\n",
      "WHERE EXISTS(t.mentions_Rubio) \n",
      "WITH t.text as tweetText\n",
      "WHERE rand()<.001\n",
      "RETURN tweetText LIMIT 10\n",
      "\n",
      "\n",
      "CANDIDATE: Cruz\n",
      "MATCH (t:Tweet_2016_2_12)\n",
      "WHERE EXISTS(t.mentions_Cruz) \n",
      "WITH t.text as tweetText\n",
      "WHERE rand()<.001\n",
      "RETURN tweetText LIMIT 10\n",
      "\n",
      "\n",
      "Time for partition 2016_2_12: 3.78462600708\n",
      "PARTITION: 2016_2_13\n",
      "\n",
      "CANDIDATE: Trump\n",
      "MATCH (t:Tweet_2016_2_13)\n",
      "WHERE EXISTS(t.mentions_Trump) \n",
      "WITH t.text as tweetText\n",
      "WHERE rand()<.0001\n",
      "RETURN tweetText LIMIT 10\n",
      "\n",
      "\n",
      "CANDIDATE: Clinton\n",
      "MATCH (t:Tweet_2016_2_13)\n",
      "WHERE EXISTS(t.mentions_Clinton) \n",
      "WITH t.text as tweetText\n",
      "WHERE rand()<.001\n",
      "RETURN tweetText LIMIT 10\n",
      "\n",
      "\n",
      "CANDIDATE: Sanders\n",
      "MATCH (t:Tweet_2016_2_13)\n",
      "WHERE EXISTS(t.mentions_Sanders) \n",
      "WITH t.text as tweetText\n",
      "WHERE rand()<.001\n",
      "RETURN tweetText LIMIT 10\n",
      "\n",
      "\n",
      "CANDIDATE: Rubio\n",
      "MATCH (t:Tweet_2016_2_13)\n",
      "WHERE EXISTS(t.mentions_Rubio) \n",
      "WITH t.text as tweetText\n",
      "WHERE rand()<.001\n",
      "RETURN tweetText LIMIT 10\n",
      "\n",
      "\n",
      "CANDIDATE: Cruz\n",
      "MATCH (t:Tweet_2016_2_13)\n",
      "WHERE EXISTS(t.mentions_Cruz) \n",
      "WITH t.text as tweetText\n",
      "WHERE rand()<.001\n",
      "RETURN tweetText LIMIT 10\n",
      "\n",
      "\n",
      "Time for partition 2016_2_13: 17.5583610535\n",
      "PARTITION: 2016_2_14\n",
      "\n",
      "CANDIDATE: Trump\n",
      "MATCH (t:Tweet_2016_2_14)\n",
      "WHERE EXISTS(t.mentions_Trump) \n",
      "WITH t.text as tweetText\n",
      "WHERE rand()<.0001\n",
      "RETURN tweetText LIMIT 10\n",
      "\n",
      "\n",
      "CANDIDATE: Clinton\n",
      "MATCH (t:Tweet_2016_2_14)\n",
      "WHERE EXISTS(t.mentions_Clinton) \n",
      "WITH t.text as tweetText\n",
      "WHERE rand()<.001\n",
      "RETURN tweetText LIMIT 10\n",
      "\n",
      "\n",
      "CANDIDATE: Sanders\n",
      "MATCH (t:Tweet_2016_2_14)\n",
      "WHERE EXISTS(t.mentions_Sanders) \n",
      "WITH t.text as tweetText\n",
      "WHERE rand()<.001\n",
      "RETURN tweetText LIMIT 10\n",
      "\n",
      "\n",
      "CANDIDATE: Rubio\n",
      "MATCH (t:Tweet_2016_2_14)\n",
      "WHERE EXISTS(t.mentions_Rubio) \n",
      "WITH t.text as tweetText\n",
      "WHERE rand()<.001\n",
      "RETURN tweetText LIMIT 10\n",
      "\n",
      "\n",
      "CANDIDATE: Cruz\n",
      "MATCH (t:Tweet_2016_2_14)\n",
      "WHERE EXISTS(t.mentions_Cruz) \n",
      "WITH t.text as tweetText\n",
      "WHERE rand()<.001\n",
      "RETURN tweetText LIMIT 10\n",
      "\n",
      "\n",
      "Time for partition 2016_2_14: 37.0196430683\n",
      "PARTITION: 2016_2_15\n",
      "\n",
      "CANDIDATE: Trump\n",
      "MATCH (t:Tweet_2016_2_15)\n",
      "WHERE EXISTS(t.mentions_Trump) \n",
      "WITH t.text as tweetText\n",
      "WHERE rand()<.0001\n",
      "RETURN tweetText LIMIT 10\n",
      "\n",
      "\n",
      "CANDIDATE: Clinton\n",
      "MATCH (t:Tweet_2016_2_15)\n",
      "WHERE EXISTS(t.mentions_Clinton) \n",
      "WITH t.text as tweetText\n",
      "WHERE rand()<.001\n",
      "RETURN tweetText LIMIT 10\n",
      "\n",
      "\n",
      "CANDIDATE: Sanders\n",
      "MATCH (t:Tweet_2016_2_15)\n",
      "WHERE EXISTS(t.mentions_Sanders) \n",
      "WITH t.text as tweetText\n",
      "WHERE rand()<.001\n",
      "RETURN tweetText LIMIT 10\n",
      "\n",
      "\n",
      "CANDIDATE: Rubio\n",
      "MATCH (t:Tweet_2016_2_15)\n",
      "WHERE EXISTS(t.mentions_Rubio) \n",
      "WITH t.text as tweetText\n",
      "WHERE rand()<.001\n",
      "RETURN tweetText LIMIT 10\n",
      "\n",
      "\n",
      "CANDIDATE: Cruz\n",
      "MATCH (t:Tweet_2016_2_15)\n",
      "WHERE EXISTS(t.mentions_Cruz) \n",
      "WITH t.text as tweetText\n",
      "WHERE rand()<.001\n",
      "RETURN tweetText LIMIT 10\n",
      "\n",
      "\n",
      "Time for partition 2016_2_15: 27.0228490829\n",
      "PARTITION: 2016_2_23\n",
      "\n",
      "CANDIDATE: Trump\n",
      "MATCH (t:Tweet_2016_2_23)\n",
      "WHERE EXISTS(t.mentions_Trump) \n",
      "WITH t.text as tweetText\n",
      "WHERE rand()<.0001\n",
      "RETURN tweetText LIMIT 10\n",
      "\n",
      "\n",
      "CANDIDATE: Clinton\n",
      "MATCH (t:Tweet_2016_2_23)\n",
      "WHERE EXISTS(t.mentions_Clinton) \n",
      "WITH t.text as tweetText\n",
      "WHERE rand()<.001\n",
      "RETURN tweetText LIMIT 10\n",
      "\n",
      "\n",
      "CANDIDATE: Sanders\n",
      "MATCH (t:Tweet_2016_2_23)\n",
      "WHERE EXISTS(t.mentions_Sanders) \n",
      "WITH t.text as tweetText\n",
      "WHERE rand()<.001\n",
      "RETURN tweetText LIMIT 10\n",
      "\n",
      "\n",
      "CANDIDATE: Rubio\n",
      "MATCH (t:Tweet_2016_2_23)\n",
      "WHERE EXISTS(t.mentions_Rubio) \n",
      "WITH t.text as tweetText\n",
      "WHERE rand()<.001\n",
      "RETURN tweetText LIMIT 10\n",
      "\n",
      "\n",
      "CANDIDATE: Cruz\n",
      "MATCH (t:Tweet_2016_2_23)\n",
      "WHERE EXISTS(t.mentions_Cruz) \n",
      "WITH t.text as tweetText\n",
      "WHERE rand()<.001\n",
      "RETURN tweetText LIMIT 10\n",
      "\n",
      "\n",
      "Time for partition 2016_2_23: 25.5432350636\n",
      "PARTITION: 2016_2_24\n",
      "\n",
      "CANDIDATE: Trump\n",
      "MATCH (t:Tweet_2016_2_24)\n",
      "WHERE EXISTS(t.mentions_Trump) \n",
      "WITH t.text as tweetText\n",
      "WHERE rand()<.0001\n",
      "RETURN tweetText LIMIT 10\n",
      "\n",
      "\n",
      "CANDIDATE: Clinton\n",
      "MATCH (t:Tweet_2016_2_24)\n",
      "WHERE EXISTS(t.mentions_Clinton) \n",
      "WITH t.text as tweetText\n",
      "WHERE rand()<.001\n",
      "RETURN tweetText LIMIT 10\n",
      "\n",
      "\n",
      "CANDIDATE: Sanders\n",
      "MATCH (t:Tweet_2016_2_24)\n",
      "WHERE EXISTS(t.mentions_Sanders) \n",
      "WITH t.text as tweetText\n",
      "WHERE rand()<.001\n",
      "RETURN tweetText LIMIT 10\n",
      "\n",
      "\n",
      "CANDIDATE: Rubio\n",
      "MATCH (t:Tweet_2016_2_24)\n",
      "WHERE EXISTS(t.mentions_Rubio) \n",
      "WITH t.text as tweetText\n",
      "WHERE rand()<.001\n",
      "RETURN tweetText LIMIT 10\n",
      "\n",
      "\n",
      "CANDIDATE: Cruz\n",
      "MATCH (t:Tweet_2016_2_24)\n",
      "WHERE EXISTS(t.mentions_Cruz) \n",
      "WITH t.text as tweetText\n",
      "WHERE rand()<.001\n",
      "RETURN tweetText LIMIT 10\n",
      "\n",
      "\n",
      "Time for partition 2016_2_24: 37.9189729691\n",
      "PARTITION: 2016_2_25\n",
      "\n",
      "CANDIDATE: Trump\n",
      "MATCH (t:Tweet_2016_2_25)\n",
      "WHERE EXISTS(t.mentions_Trump) \n",
      "WITH t.text as tweetText\n",
      "WHERE rand()<.0001\n",
      "RETURN tweetText LIMIT 10\n",
      "\n",
      "\n",
      "CANDIDATE: Clinton\n",
      "MATCH (t:Tweet_2016_2_25)\n",
      "WHERE EXISTS(t.mentions_Clinton) \n",
      "WITH t.text as tweetText\n",
      "WHERE rand()<.001\n",
      "RETURN tweetText LIMIT 10\n",
      "\n",
      "\n",
      "CANDIDATE: Sanders\n",
      "MATCH (t:Tweet_2016_2_25)\n",
      "WHERE EXISTS(t.mentions_Sanders) \n",
      "WITH t.text as tweetText\n",
      "WHERE rand()<.001\n",
      "RETURN tweetText LIMIT 10\n",
      "\n",
      "\n",
      "CANDIDATE: Rubio\n",
      "MATCH (t:Tweet_2016_2_25)\n",
      "WHERE EXISTS(t.mentions_Rubio) \n",
      "WITH t.text as tweetText\n",
      "WHERE rand()<.001\n",
      "RETURN tweetText LIMIT 10\n",
      "\n",
      "\n",
      "CANDIDATE: Cruz\n",
      "MATCH (t:Tweet_2016_2_25)\n",
      "WHERE EXISTS(t.mentions_Cruz) \n",
      "WITH t.text as tweetText\n",
      "WHERE rand()<.001\n",
      "RETURN tweetText LIMIT 10\n",
      "\n",
      "\n",
      "Time for partition 2016_2_25: 55.3238759041\n",
      "PARTITION: 2016_2_26\n",
      "\n",
      "CANDIDATE: Trump\n",
      "MATCH (t:Tweet_2016_2_26)\n",
      "WHERE EXISTS(t.mentions_Trump) \n",
      "WITH t.text as tweetText\n",
      "WHERE rand()<.0001\n",
      "RETURN tweetText LIMIT 10\n",
      "\n",
      "\n",
      "CANDIDATE: Clinton\n",
      "MATCH (t:Tweet_2016_2_26)\n",
      "WHERE EXISTS(t.mentions_Clinton) \n",
      "WITH t.text as tweetText\n",
      "WHERE rand()<.001\n",
      "RETURN tweetText LIMIT 10\n",
      "\n",
      "\n",
      "CANDIDATE: Sanders\n",
      "MATCH (t:Tweet_2016_2_26)\n",
      "WHERE EXISTS(t.mentions_Sanders) \n",
      "WITH t.text as tweetText\n",
      "WHERE rand()<.001\n",
      "RETURN tweetText LIMIT 10\n",
      "\n",
      "\n",
      "CANDIDATE: Rubio\n",
      "MATCH (t:Tweet_2016_2_26)\n",
      "WHERE EXISTS(t.mentions_Rubio) \n",
      "WITH t.text as tweetText\n",
      "WHERE rand()<.001\n",
      "RETURN tweetText LIMIT 10\n",
      "\n",
      "\n",
      "CANDIDATE: Cruz\n",
      "MATCH (t:Tweet_2016_2_26)\n",
      "WHERE EXISTS(t.mentions_Cruz) \n",
      "WITH t.text as tweetText\n",
      "WHERE rand()<.001\n",
      "RETURN tweetText LIMIT 10\n",
      "\n",
      "\n",
      "Time for partition 2016_2_26: 47.8965201378\n",
      "PARTITION: 2016_3_1\n",
      "\n",
      "CANDIDATE: Trump\n",
      "MATCH (t:Tweet_2016_3_1)\n",
      "WHERE EXISTS(t.mentions_Trump) \n",
      "WITH t.text as tweetText\n",
      "WHERE rand()<.0001\n",
      "RETURN tweetText LIMIT 10\n",
      "\n",
      "\n",
      "CANDIDATE: Clinton\n",
      "MATCH (t:Tweet_2016_3_1)\n",
      "WHERE EXISTS(t.mentions_Clinton) \n",
      "WITH t.text as tweetText\n",
      "WHERE rand()<.001\n",
      "RETURN tweetText LIMIT 10\n",
      "\n",
      "\n",
      "CANDIDATE: Sanders\n",
      "MATCH (t:Tweet_2016_3_1)\n",
      "WHERE EXISTS(t.mentions_Sanders) \n",
      "WITH t.text as tweetText\n",
      "WHERE rand()<.001\n",
      "RETURN tweetText LIMIT 10\n",
      "\n",
      "\n",
      "CANDIDATE: Rubio\n",
      "MATCH (t:Tweet_2016_3_1)\n",
      "WHERE EXISTS(t.mentions_Rubio) \n",
      "WITH t.text as tweetText\n",
      "WHERE rand()<.001\n",
      "RETURN tweetText LIMIT 10\n",
      "\n",
      "\n",
      "CANDIDATE: Cruz\n",
      "MATCH (t:Tweet_2016_3_1)\n",
      "WHERE EXISTS(t.mentions_Cruz) \n",
      "WITH t.text as tweetText\n",
      "WHERE rand()<.001\n",
      "RETURN tweetText LIMIT 10\n",
      "\n",
      "\n",
      "Time for partition 2016_3_1: 21.490363121\n",
      "PARTITION: 2016_3_2\n",
      "\n",
      "CANDIDATE: Trump\n",
      "MATCH (t:Tweet_2016_3_2)\n",
      "WHERE EXISTS(t.mentions_Trump) \n",
      "WITH t.text as tweetText\n",
      "WHERE rand()<.0001\n",
      "RETURN tweetText LIMIT 10\n",
      "\n",
      "\n",
      "CANDIDATE: Clinton\n",
      "MATCH (t:Tweet_2016_3_2)\n",
      "WHERE EXISTS(t.mentions_Clinton) \n",
      "WITH t.text as tweetText\n",
      "WHERE rand()<.001\n",
      "RETURN tweetText LIMIT 10\n",
      "\n",
      "\n",
      "CANDIDATE: Sanders\n",
      "MATCH (t:Tweet_2016_3_2)\n",
      "WHERE EXISTS(t.mentions_Sanders) \n",
      "WITH t.text as tweetText\n",
      "WHERE rand()<.001\n",
      "RETURN tweetText LIMIT 10\n",
      "\n",
      "\n",
      "CANDIDATE: Rubio\n",
      "MATCH (t:Tweet_2016_3_2)\n",
      "WHERE EXISTS(t.mentions_Rubio) \n",
      "WITH t.text as tweetText\n",
      "WHERE rand()<.001\n",
      "RETURN tweetText LIMIT 10\n",
      "\n",
      "\n",
      "CANDIDATE: Cruz\n",
      "MATCH (t:Tweet_2016_3_2)\n",
      "WHERE EXISTS(t.mentions_Cruz) \n",
      "WITH t.text as tweetText\n",
      "WHERE rand()<.001\n",
      "RETURN tweetText LIMIT 10\n",
      "\n",
      "\n",
      "Time for partition 2016_3_2: 23.2195541859\n",
      "PARTITION: 2016_3_3\n",
      "\n",
      "CANDIDATE: Trump\n",
      "MATCH (t:Tweet_2016_3_3)\n",
      "WHERE EXISTS(t.mentions_Trump) \n",
      "WITH t.text as tweetText\n",
      "WHERE rand()<.0001\n",
      "RETURN tweetText LIMIT 10\n",
      "\n",
      "\n",
      "CANDIDATE: Clinton\n",
      "MATCH (t:Tweet_2016_3_3)\n",
      "WHERE EXISTS(t.mentions_Clinton) \n",
      "WITH t.text as tweetText\n",
      "WHERE rand()<.001\n",
      "RETURN tweetText LIMIT 10\n",
      "\n",
      "\n",
      "CANDIDATE: Sanders\n",
      "MATCH (t:Tweet_2016_3_3)\n",
      "WHERE EXISTS(t.mentions_Sanders) \n",
      "WITH t.text as tweetText\n",
      "WHERE rand()<.001\n",
      "RETURN tweetText LIMIT 10\n",
      "\n",
      "\n",
      "CANDIDATE: Rubio\n",
      "MATCH (t:Tweet_2016_3_3)\n",
      "WHERE EXISTS(t.mentions_Rubio) \n",
      "WITH t.text as tweetText\n",
      "WHERE rand()<.001\n",
      "RETURN tweetText LIMIT 10\n",
      "\n",
      "\n",
      "CANDIDATE: Cruz\n",
      "MATCH (t:Tweet_2016_3_3)\n",
      "WHERE EXISTS(t.mentions_Cruz) \n",
      "WITH t.text as tweetText\n",
      "WHERE rand()<.001\n",
      "RETURN tweetText LIMIT 10\n",
      "\n",
      "\n",
      "Time for partition 2016_3_3: 13.6982440948\n",
      "PARTITION: 2016_3_4\n",
      "\n",
      "CANDIDATE: Trump\n",
      "MATCH (t:Tweet_2016_3_4)\n",
      "WHERE EXISTS(t.mentions_Trump) \n",
      "WITH t.text as tweetText\n",
      "WHERE rand()<.0001\n",
      "RETURN tweetText LIMIT 10\n",
      "\n",
      "\n",
      "CANDIDATE: Clinton\n",
      "MATCH (t:Tweet_2016_3_4)\n",
      "WHERE EXISTS(t.mentions_Clinton) \n",
      "WITH t.text as tweetText\n",
      "WHERE rand()<.001\n",
      "RETURN tweetText LIMIT 10\n",
      "\n",
      "\n",
      "CANDIDATE: Sanders\n",
      "MATCH (t:Tweet_2016_3_4)\n",
      "WHERE EXISTS(t.mentions_Sanders) \n",
      "WITH t.text as tweetText\n",
      "WHERE rand()<.001\n",
      "RETURN tweetText LIMIT 10\n",
      "\n",
      "\n",
      "CANDIDATE: Rubio\n",
      "MATCH (t:Tweet_2016_3_4)\n",
      "WHERE EXISTS(t.mentions_Rubio) \n",
      "WITH t.text as tweetText\n",
      "WHERE rand()<.001\n",
      "RETURN tweetText LIMIT 10\n",
      "\n",
      "\n",
      "CANDIDATE: Cruz\n",
      "MATCH (t:Tweet_2016_3_4)\n",
      "WHERE EXISTS(t.mentions_Cruz) \n",
      "WITH t.text as tweetText\n",
      "WHERE rand()<.001\n",
      "RETURN tweetText LIMIT 10\n",
      "\n",
      "\n",
      "Time for partition 2016_3_4: 6.27956795692\n",
      "PARTITION: 2016_3_5\n",
      "\n",
      "CANDIDATE: Trump\n",
      "MATCH (t:Tweet_2016_3_5)\n",
      "WHERE EXISTS(t.mentions_Trump) \n",
      "WITH t.text as tweetText\n",
      "WHERE rand()<.0001\n",
      "RETURN tweetText LIMIT 10\n",
      "\n",
      "\n",
      "CANDIDATE: Clinton\n",
      "MATCH (t:Tweet_2016_3_5)\n",
      "WHERE EXISTS(t.mentions_Clinton) \n",
      "WITH t.text as tweetText\n",
      "WHERE rand()<.001\n",
      "RETURN tweetText LIMIT 10\n",
      "\n",
      "\n",
      "CANDIDATE: Sanders\n",
      "MATCH (t:Tweet_2016_3_5)\n",
      "WHERE EXISTS(t.mentions_Sanders) \n",
      "WITH t.text as tweetText\n",
      "WHERE rand()<.001\n",
      "RETURN tweetText LIMIT 10\n",
      "\n",
      "\n",
      "CANDIDATE: Rubio\n",
      "MATCH (t:Tweet_2016_3_5)\n",
      "WHERE EXISTS(t.mentions_Rubio) \n",
      "WITH t.text as tweetText\n",
      "WHERE rand()<.001\n",
      "RETURN tweetText LIMIT 10\n",
      "\n",
      "\n",
      "CANDIDATE: Cruz\n",
      "MATCH (t:Tweet_2016_3_5)\n",
      "WHERE EXISTS(t.mentions_Cruz) \n",
      "WITH t.text as tweetText\n",
      "WHERE rand()<.001\n",
      "RETURN tweetText LIMIT 10\n",
      "\n",
      "\n",
      "Time for partition 2016_3_5: 5.35798311234\n",
      "PARTITION: 2016_3_6\n",
      "\n",
      "CANDIDATE: Trump\n",
      "MATCH (t:Tweet_2016_3_6)\n",
      "WHERE EXISTS(t.mentions_Trump) \n",
      "WITH t.text as tweetText\n",
      "WHERE rand()<.0001\n",
      "RETURN tweetText LIMIT 10\n",
      "\n",
      "\n",
      "CANDIDATE: Clinton\n",
      "MATCH (t:Tweet_2016_3_6)\n",
      "WHERE EXISTS(t.mentions_Clinton) \n",
      "WITH t.text as tweetText\n",
      "WHERE rand()<.001\n",
      "RETURN tweetText LIMIT 10\n",
      "\n",
      "\n",
      "CANDIDATE: Sanders\n",
      "MATCH (t:Tweet_2016_3_6)\n",
      "WHERE EXISTS(t.mentions_Sanders) \n",
      "WITH t.text as tweetText\n",
      "WHERE rand()<.001\n",
      "RETURN tweetText LIMIT 10\n",
      "\n",
      "\n",
      "CANDIDATE: Rubio\n",
      "MATCH (t:Tweet_2016_3_6)\n",
      "WHERE EXISTS(t.mentions_Rubio) \n",
      "WITH t.text as tweetText\n",
      "WHERE rand()<.001\n",
      "RETURN tweetText LIMIT 10\n",
      "\n",
      "\n",
      "CANDIDATE: Cruz\n",
      "MATCH (t:Tweet_2016_3_6)\n",
      "WHERE EXISTS(t.mentions_Cruz) \n",
      "WITH t.text as tweetText\n",
      "WHERE rand()<.001\n",
      "RETURN tweetText LIMIT 10\n",
      "\n",
      "\n",
      "Time for partition 2016_3_6: 4.93198204041\n",
      "PARTITION: 2016_3_7\n",
      "\n",
      "CANDIDATE: Trump\n",
      "MATCH (t:Tweet_2016_3_7)\n",
      "WHERE EXISTS(t.mentions_Trump) \n",
      "WITH t.text as tweetText\n",
      "WHERE rand()<.0001\n",
      "RETURN tweetText LIMIT 10\n",
      "\n",
      "\n",
      "CANDIDATE: Clinton\n",
      "MATCH (t:Tweet_2016_3_7)\n",
      "WHERE EXISTS(t.mentions_Clinton) \n",
      "WITH t.text as tweetText\n",
      "WHERE rand()<.001\n",
      "RETURN tweetText LIMIT 10\n",
      "\n",
      "\n",
      "CANDIDATE: Sanders\n",
      "MATCH (t:Tweet_2016_3_7)\n",
      "WHERE EXISTS(t.mentions_Sanders) \n",
      "WITH t.text as tweetText\n",
      "WHERE rand()<.001\n",
      "RETURN tweetText LIMIT 10\n",
      "\n",
      "\n",
      "CANDIDATE: Rubio\n",
      "MATCH (t:Tweet_2016_3_7)\n",
      "WHERE EXISTS(t.mentions_Rubio) \n",
      "WITH t.text as tweetText\n",
      "WHERE rand()<.001\n",
      "RETURN tweetText LIMIT 10\n",
      "\n",
      "\n",
      "CANDIDATE: Cruz\n",
      "MATCH (t:Tweet_2016_3_7)\n",
      "WHERE EXISTS(t.mentions_Cruz) \n",
      "WITH t.text as tweetText\n",
      "WHERE rand()<.001\n",
      "RETURN tweetText LIMIT 10\n",
      "\n",
      "\n",
      "Time for partition 2016_3_7: 8.80639004707\n",
      "PARTITION: 2016_3_8\n",
      "\n",
      "CANDIDATE: Trump\n",
      "MATCH (t:Tweet_2016_3_8)\n",
      "WHERE EXISTS(t.mentions_Trump) \n",
      "WITH t.text as tweetText\n",
      "WHERE rand()<.0001\n",
      "RETURN tweetText LIMIT 10\n",
      "\n",
      "\n",
      "CANDIDATE: Clinton\n",
      "MATCH (t:Tweet_2016_3_8)\n",
      "WHERE EXISTS(t.mentions_Clinton) \n",
      "WITH t.text as tweetText\n",
      "WHERE rand()<.001\n",
      "RETURN tweetText LIMIT 10\n",
      "\n",
      "\n",
      "CANDIDATE: Sanders\n",
      "MATCH (t:Tweet_2016_3_8)\n",
      "WHERE EXISTS(t.mentions_Sanders) \n",
      "WITH t.text as tweetText\n",
      "WHERE rand()<.001\n",
      "RETURN tweetText LIMIT 10\n",
      "\n",
      "\n",
      "CANDIDATE: Rubio\n",
      "MATCH (t:Tweet_2016_3_8)\n",
      "WHERE EXISTS(t.mentions_Rubio) \n",
      "WITH t.text as tweetText\n",
      "WHERE rand()<.001\n",
      "RETURN tweetText LIMIT 10\n",
      "\n",
      "\n",
      "CANDIDATE: Cruz\n",
      "MATCH (t:Tweet_2016_3_8)\n",
      "WHERE EXISTS(t.mentions_Cruz) \n",
      "WITH t.text as tweetText\n",
      "WHERE rand()<.001\n",
      "RETURN tweetText LIMIT 10\n",
      "\n",
      "\n",
      "Time for partition 2016_3_8: 9.19616293907\n",
      "PARTITION: 2016_3_9\n",
      "\n",
      "CANDIDATE: Trump\n",
      "MATCH (t:Tweet_2016_3_9)\n",
      "WHERE EXISTS(t.mentions_Trump) \n",
      "WITH t.text as tweetText\n",
      "WHERE rand()<.0001\n",
      "RETURN tweetText LIMIT 10\n",
      "\n",
      "\n",
      "CANDIDATE: Clinton\n",
      "MATCH (t:Tweet_2016_3_9)\n",
      "WHERE EXISTS(t.mentions_Clinton) \n",
      "WITH t.text as tweetText\n",
      "WHERE rand()<.001\n",
      "RETURN tweetText LIMIT 10\n",
      "\n",
      "\n",
      "CANDIDATE: Sanders\n",
      "MATCH (t:Tweet_2016_3_9)\n",
      "WHERE EXISTS(t.mentions_Sanders) \n",
      "WITH t.text as tweetText\n",
      "WHERE rand()<.001\n",
      "RETURN tweetText LIMIT 10\n",
      "\n",
      "\n",
      "CANDIDATE: Rubio\n",
      "MATCH (t:Tweet_2016_3_9)\n",
      "WHERE EXISTS(t.mentions_Rubio) \n",
      "WITH t.text as tweetText\n",
      "WHERE rand()<.001\n",
      "RETURN tweetText LIMIT 10\n",
      "\n",
      "\n",
      "CANDIDATE: Cruz\n",
      "MATCH (t:Tweet_2016_3_9)\n",
      "WHERE EXISTS(t.mentions_Cruz) \n",
      "WITH t.text as tweetText\n",
      "WHERE rand()<.001\n",
      "RETURN tweetText LIMIT 10\n",
      "\n",
      "\n",
      "Time for partition 2016_3_9: 6.11221194267\n",
      "PARTITION: 2016_3_10\n",
      "\n",
      "CANDIDATE: Trump\n",
      "MATCH (t:Tweet_2016_3_10)\n",
      "WHERE EXISTS(t.mentions_Trump) \n",
      "WITH t.text as tweetText\n",
      "WHERE rand()<.0001\n",
      "RETURN tweetText LIMIT 10\n",
      "\n",
      "\n",
      "CANDIDATE: Clinton\n",
      "MATCH (t:Tweet_2016_3_10)\n",
      "WHERE EXISTS(t.mentions_Clinton) \n",
      "WITH t.text as tweetText\n",
      "WHERE rand()<.001\n",
      "RETURN tweetText LIMIT 10\n",
      "\n",
      "\n",
      "CANDIDATE: Sanders\n",
      "MATCH (t:Tweet_2016_3_10)\n",
      "WHERE EXISTS(t.mentions_Sanders) \n",
      "WITH t.text as tweetText\n",
      "WHERE rand()<.001\n",
      "RETURN tweetText LIMIT 10\n",
      "\n",
      "\n",
      "CANDIDATE: Rubio\n",
      "MATCH (t:Tweet_2016_3_10)\n",
      "WHERE EXISTS(t.mentions_Rubio) \n",
      "WITH t.text as tweetText\n",
      "WHERE rand()<.001\n",
      "RETURN tweetText LIMIT 10\n",
      "\n",
      "\n",
      "CANDIDATE: Cruz\n",
      "MATCH (t:Tweet_2016_3_10)\n",
      "WHERE EXISTS(t.mentions_Cruz) \n",
      "WITH t.text as tweetText\n",
      "WHERE rand()<.001\n",
      "RETURN tweetText LIMIT 10\n",
      "\n",
      "\n",
      "Time for partition 2016_3_10: 16.8587989807\n",
      "PARTITION: 2016_3_11\n",
      "\n",
      "CANDIDATE: Trump\n",
      "MATCH (t:Tweet_2016_3_11)\n",
      "WHERE EXISTS(t.mentions_Trump) \n",
      "WITH t.text as tweetText\n",
      "WHERE rand()<.0001\n",
      "RETURN tweetText LIMIT 10\n",
      "\n",
      "\n",
      "CANDIDATE: Clinton\n",
      "MATCH (t:Tweet_2016_3_11)\n",
      "WHERE EXISTS(t.mentions_Clinton) \n",
      "WITH t.text as tweetText\n",
      "WHERE rand()<.001\n",
      "RETURN tweetText LIMIT 10\n",
      "\n",
      "\n",
      "CANDIDATE: Sanders\n",
      "MATCH (t:Tweet_2016_3_11)\n",
      "WHERE EXISTS(t.mentions_Sanders) \n",
      "WITH t.text as tweetText\n",
      "WHERE rand()<.001\n",
      "RETURN tweetText LIMIT 10\n",
      "\n",
      "\n",
      "CANDIDATE: Rubio\n",
      "MATCH (t:Tweet_2016_3_11)\n",
      "WHERE EXISTS(t.mentions_Rubio) \n",
      "WITH t.text as tweetText\n",
      "WHERE rand()<.001\n",
      "RETURN tweetText LIMIT 10\n",
      "\n",
      "\n",
      "CANDIDATE: Cruz\n",
      "MATCH (t:Tweet_2016_3_11)\n",
      "WHERE EXISTS(t.mentions_Cruz) \n",
      "WITH t.text as tweetText\n",
      "WHERE rand()<.001\n",
      "RETURN tweetText LIMIT 10\n",
      "\n",
      "\n",
      "Time for partition 2016_3_11: 4.14990401268\n",
      "Total time:1041.40479183\n",
      "done\n"
     ]
    }
   ],
   "source": [
    "# Get data from neo4j and write to file.\n",
    "\n",
    "#with open('sentimentsamples.csv', 'wb') as csvfile:\n",
    "with open(outfile, 'wb') as csvfile:\n",
    "    tweetwriter = csv.writer(csvfile)\n",
    "    total_start = time.time()\n",
    "    \n",
    "    for partition in partitions:\n",
    "    #for partition in ['2016_2_12']:\n",
    "\n",
    "        print \"PARTITION:\", partition\n",
    "        partition_start = time.time()\n",
    "        \n",
    "        for candidate in candidates:\n",
    "            print\n",
    "            print \"CANDIDATE:\", candidate\n",
    "\n",
    "            start = time.time()\n",
    "\n",
    "            query = queries[candidate].format(partition)\n",
    "            print query\n",
    "\n",
    "            session = driver.session()\n",
    "            result = session.run(query)\n",
    "\n",
    "            for record in result:\n",
    "                #print partition, candidate, record[0]\n",
    "                #tweetwriter.writerow([partition,candidate,'pos','supporter',record[0].encode(\"utf-8\")])\n",
    "                tweetwriter.writerow([partition, candidate, record[0].encode(\"utf-8\")])\n",
    "\n",
    "            session.close()\n",
    "\n",
    "            end = time.time()\n",
    "        print\n",
    "        print \"Time for partition \" + partition + \": \" + str(time.time() - partition_start)\n",
    "    print \"Total time:\" + str(time.time() - total_start)\n",
    "    \n",
    "print 'done'    "
   ]
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "metadata": {
    "collapsed": true
   },
   "outputs": [],
   "source": []
  }
 ],
 "metadata": {
  "kernelspec": {
   "display_name": "Python 2",
   "language": "python",
   "name": "python2"
  },
  "language_info": {
   "codemirror_mode": {
    "name": "ipython",
    "version": 2
   },
   "file_extension": ".py",
   "mimetype": "text/x-python",
   "name": "python",
   "nbconvert_exporter": "python",
   "pygments_lexer": "ipython2",
   "version": "2.7.9"
  }
 },
 "nbformat": 4,
 "nbformat_minor": 0
}
